update wireframe diagram
